namespace AlgoritmTest12
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Напишите программу, которая переводит число (возможно, отрицательное),
            //записанное в шестнадцатеричной системе, в десятичную систему.
            //Входная строка содержит шестнадцатеричную запись числа N ( 1 ≤ | N | < 10 pow(9) ).
            //входные данные: AB
            //выходные данные: 171
            //входные данные: -BC
            //выходные данные: -188




            Console.ReadKey();
        }
    }
}
